import { defineConfig } from "vitepress";
import { getSidebars } from "./configs/sidebars.mts";
import dotenv from "dotenv";
dotenv.config();

const sidebar = getSidebars();

// https://vitepress.dev/reference/site-config
export default defineConfig({
  title: "Anton修仙传",
  description: "我的修仙生涯心法",
  head: [["link", { rel: "icon", href: "/Front-End-Immortality/head.png" }]],
  themeConfig: {
    // https://vitepress.dev/reference/default-theme-config
    nav: [
      { text: "首页", link: "/" },
      { text: "AntonCook", link: "https://mrfaucet.antoncook.xyz" },
      { text: "Emoji Finder", link: "https://antonhu.github.io/emoji" },
    ],

    sidebar,
    aside: true,
    outline: {
      level: "deep",
      label: "本文大纲",
    },

    socialLinks: [
      { icon: "github", link: "https://github.com/AntonHu" },
      {
        icon: {
          svg: '<svg color="rgb(41,134,255)" role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>掘金</title><path d="m12 14.316 7.454-5.88-2.022-1.625L12 11.1l-.004.003-5.432-4.288-2.02 1.624 7.452 5.88Zm0-7.247 2.89-2.298L12 2.453l-.004-.005-2.884 2.318 2.884 2.3Zm0 11.266-.005.002-9.975-7.87L0 12.088l.194.156 11.803 9.308 7.463-5.885L24 12.085l-2.023-1.624Z"/></svg>',
        },
        link: "https://juejin.cn/user/3966693684293240",
      },
      {
        icon: {
          svg: '<svg color="#00A1D6" role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>哔哩哔哩</title><path d="M17.813 4.653h.854c1.51.054 2.769.578 3.773 1.574 1.004.995 1.524 2.249 1.56 3.76v7.36c-.036 1.51-.556 2.769-1.56 3.773s-2.262 1.524-3.773 1.56H5.333c-1.51-.036-2.769-.556-3.773-1.56S.036 18.858 0 17.347v-7.36c.036-1.511.556-2.765 1.56-3.76 1.004-.996 2.262-1.52 3.773-1.574h.774l-1.174-1.12a1.234 1.234 0 0 1-.373-.906c0-.356.124-.658.373-.907l.027-.027c.267-.249.573-.373.92-.373.347 0 .653.124.92.373L9.653 4.44c.071.071.134.142.187.213h4.267a.836.836 0 0 1 .16-.213l2.853-2.747c.267-.249.573-.373.92-.373.347 0 .662.151.929.4.267.249.391.551.391.907 0 .355-.124.657-.373.906zM5.333 7.24c-.746.018-1.373.276-1.88.773-.506.498-.769 1.13-.786 1.894v7.52c.017.764.28 1.395.786 1.893.507.498 1.134.756 1.88.773h13.334c.746-.017 1.373-.275 1.88-.773.506-.498.769-1.129.786-1.893v-7.52c-.017-.765-.28-1.396-.786-1.894-.507-.497-1.134-.755-1.88-.773zM8 11.107c.373 0 .684.124.933.373.25.249.383.569.4.96v1.173c-.017.391-.15.711-.4.96-.249.25-.56.374-.933.374s-.684-.125-.933-.374c-.25-.249-.383-.569-.4-.96V12.44c0-.373.129-.689.386-.947.258-.257.574-.386.947-.386zm8 0c.373 0 .684.124.933.373.25.249.383.569.4.96v1.173c-.017.391-.15.711-.4.96-.249.25-.56.374-.933.374s-.684-.125-.933-.374c-.25-.249-.383-.569-.4-.96V12.44c.017-.391.15-.711.4-.96.249-.249.56-.373.933-.373Z"/></svg>',
        },
        link: "https://space.bilibili.com/480116677",
      },
      {
        icon: {
          svg: '<svg color="rgb(23,114,246)" backgroundColor="white" role="img" viewBox="0 0 24 24" xmlns="http://www.w3.org/2000/svg"><title>知乎</title><path d="M5.721 0C2.251 0 0 2.25 0 5.719V18.28C0 21.751 2.252 24 5.721 24h12.56C21.751 24 24 21.75 24 18.281V5.72C24 2.249 21.75 0 18.281 0zm1.964 4.078c-.271.73-.5 1.434-.68 2.11h4.587c.545-.006.445 1.168.445 1.171H9.384a58.104 58.104 0 01-.112 3.797h2.712c.388.023.393 1.251.393 1.266H9.183a9.223 9.223 0 01-.408 2.102l.757-.604c.452.456 1.512 1.712 1.906 2.177.473.681.063 2.081.063 2.081l-2.794-3.382c-.653 2.518-1.845 3.607-1.845 3.607-.523.468-1.58.82-2.64.516 2.218-1.73 3.44-3.917 3.667-6.497H4.491c0-.015.197-1.243.806-1.266h2.71c.024-.32.086-3.254.086-3.797H6.598c-.136.406-.158.447-.268.753-.594 1.095-1.603 1.122-1.907 1.155.906-1.821 1.416-3.6 1.591-4.064.425-1.124 1.671-1.125 1.671-1.125zM13.078 6h6.377v11.33h-2.573l-2.184 1.373-.401-1.373h-1.219zm1.313 1.219v8.86h.623l.263.937 1.455-.938h1.456v-8.86z"/></svg>',
        },
        link: "https://zhihu.com/people/antoncook",
      },
    ],
    logo: "/logo.png",
    search: {
      provider: "local",
    },
    carbonAds: {
      code: "广告在哪里",
      placement: "根本没有广告",
    },
    footer: {
      message: "基于 MIT 许可发布",
      copyright: "版权所有 © 2024-2030 AntonCook",
    },
  },
  cleanUrls: true,
  srcDir: "docs",
  lastUpdated: true,
  base: process.env.DEPLOY_ROOT ? "/" : "/Front-End-Immortality",
  ignoreDeadLinks: "localhostLinks", // 不处理localhost域名的死链接
});
